anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR32F02/Eclipse/MDR32F02_Template/svd/MDR1206/MDR1206AFI.svd
<?xml version='1.0' encoding='utf-8' standalone='no'?>
<device schemaVersion="1.1"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <vendor>Milandr</vendor>
    <vendorID>Milandr</vendorID>
    <name>MDR1206AFI</name>
    <version>1.0</version>
    <description>MDR1206AFI</description>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>
    <cpu>
        <name>BM-310S0</name>
        <endian>little</endian>
    </cpu>
    <peripherals>
        <peripheral>
            <name>CLINT</name>
            <description>Сore Local Interruptor</description>
            <groupName>CLINT</groupName>
            <baseAddress>0x02000000</baseAddress>
            <addressBlock>
                <offset>0x00000000</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x00004000</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0000BFF8</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTMSIP</name>
                    <displayName>CTMSIP</displayName>
                    <description>Software Interrupt Request/Clear Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>msip</name>
                            <description>Waiting for software interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTMTIMECMP</name>
                    <displayName>CTMTIMECMP</displayName>
                    <description>Machine Timer Comparison Register</description>
                    <addressOffset>0x00004000</addressOffset>
                    <size>64</size>
                    <access>read-write</access>
                    <resetValue>0x0000000000000000</resetValue>
                    <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>mtimecmp_lo</name>
                            <description>Low part of the value of the comparison register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>mtimecmp_hi</name>
                            <description>High part of the value of the comparison register</description>
                            <bitOffset>32</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTMTIME</name>
                    <displayName>CTMTIME</displayName>
                    <description>Machine Timer Value Register</description>
                    <addressOffset>0x0000BFF8</addressOffset>
                    <size>64</size>
                    <access>read-write</access>
                    <resetValue>0x0000000000000000</resetValue>
                    <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>mtime_lo</name>
                            <description>Low part of the timer value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>mtime_hi</name>
                            <description>High part of the timer value</description>
                            <bitOffset>32</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>CLIC</name>
            <description>Core Local Interrupt Controller</description>
            <groupName>CLIC</groupName>
            <baseAddress>0x0D000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00008000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CLICCFG</name>
                    <displayName>CLICCFG</displayName>
                    <description>CLICCFG description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>NVBITS</name>
                            <description>NVBITS description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NLBITS</name>
                            <description>NLBITS description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>NMBITS</name>
                            <description>NMBITS description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLICINFO</name>
                    <displayName>CLICINFO</displayName>
                    <description>CLICINFO description</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NUM_INTERRUPT</name>
                            <description>NUM_INTERRUPT description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                        </field>
                        <field>
                            <name>VERSION</name>
                            <description>version description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>CLICINTCTLBITS</name>
                            <description>CLICINTCTLBITS description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>NUM_TRIGGER</name>
                            <description>NUM_TRIGGER description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLICINT[0]</name>
                    <displayName>CLICINT[0]_USIP</displayName>
                    <description>CLICINT[0]_USIP description</description>
                    <addressOffset>0x00001000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CLICINTIP_IP</name>
                            <description>IP description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLICINTIE_IE</name>
                            <description>IE description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLICINTATTR_SHV</name>
                            <description>SHV description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CLICINTATTR_TRIG</name>
                            <description>TRIG description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CLICINTATTR_MODE</name>
                            <description>MODE description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CLICINTCTL_LEVEL_PRIORITY</name>
                            <description>LEVEL_PRIORITY description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[1]</name>
                    <displayName>CLICINT[1]</displayName>
                    <description>CLICINT[1] description</description>
                    <addressOffset>0x00001004</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[2]</name>
                    <displayName>CLICINT[2]</displayName>
                    <description>CLICINT[2] description</description>
                    <addressOffset>0x00001008</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[3]</name>
                    <displayName>CLICINT[3]_MSIP</displayName>
                    <description>CLICINT[3]_MSIP description</description>
                    <addressOffset>0x0000100C</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[4]</name>
                    <displayName>CLICINT[4]_UTIP</displayName>
                    <description>CLICINT[4]_UTIP description</description>
                    <addressOffset>0x00001010</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[5]</name>
                    <displayName>CLICINT[5]</displayName>
                    <description>CLICINT[5] description</description>
                    <addressOffset>0x00001014</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[6]</name>
                    <displayName>CLICINT[6]</displayName>
                    <description>CLICINT[6] description</description>
                    <addressOffset>0x00001018</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[7]</name>
                    <displayName>CLICINT[7]_MTIP</displayName>
                    <description>CLICINT[7]_MTIP description</description>
                    <addressOffset>0x0000101C</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[8]</name>
                    <displayName>CLICINT[8]</displayName>
                    <description>CLICINT[8] description</description>
                    <addressOffset>0x00001020</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[9]</name>
                    <displayName>CLICINT[9]</displayName>
                    <description>CLICINT[9] description</description>
                    <addressOffset>0x00001024</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[10]</name>
                    <displayName>CLICINT[10]</displayName>
                    <description>CLICINT[10] description</description>
                    <addressOffset>0x00001028</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[11]</name>
                    <displayName>CLICINT[11]</displayName>
                    <description>CLICINT[11] description</description>
                    <addressOffset>0x0000102C</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[12]</name>
                    <displayName>CLICINT[12]_CSIP</displayName>
                    <description>CLICINT[12]_CSIP description</description>
                    <addressOffset>0x00001030</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[13]</name>
                    <displayName>CLICINT[13]</displayName>
                    <description>CLICINT[13] description</description>
                    <addressOffset>0x00001034</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[14]</name>
                    <displayName>CLICINT[14]</displayName>
                    <description>CLICINT[14] description</description>
                    <addressOffset>0x00001038</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[15]</name>
                    <displayName>CLICINT[15]</displayName>
                    <description>CLICINT[15] description</description>
                    <addressOffset>0x0000103C</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[16]</name>
                    <displayName>CLICINT[16]_DMA</displayName>
                    <description>CLICINT[16]_DMA description</description>
                    <addressOffset>0x00001040</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[17]</name>
                    <displayName>CLICINT[17]_UART1</displayName>
                    <description>CLICINT[17]_UART1 description</description>
                    <addressOffset>0x00001044</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[18]</name>
                    <displayName>CLICINT[18]_UART2</displayName>
                    <description>CLICINT[18]_UART2 description</description>
                    <addressOffset>0x00001048</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[19]</name>
                    <displayName>CLICINT[19]_SSP1</displayName>
                    <description>CLICINT[19]_SSP1 description</description>
                    <addressOffset>0x0000104C</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[20]</name>
                    <displayName>CLICINT[20]_POWER</displayName>
                    <description>CLICINT[20]_POWER description</description>
                    <addressOffset>0x00001050</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[21]</name>
                    <displayName>CLICINT[21]_WWDG</displayName>
                    <description>CLICINT[21]_WWDG description</description>
                    <addressOffset>0x00001054</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[22]</name>
                    <displayName>CLICINT[22]_TIMER1</displayName>
                    <description>CLICINT[22]_TIMER1 description</description>
                    <addressOffset>0x00001058</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[23]</name>
                    <displayName>CLICINT[23]_TIMER2</displayName>
                    <description>CLICINT[23]_TIMER2 description</description>
                    <addressOffset>0x0000105C</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[24]</name>
                    <displayName>CLICINT[24]_ADC</displayName>
                    <description>CLICINT[24]_ADC description</description>
                    <addressOffset>0x00001060</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[25]</name>
                    <displayName>CLICINT[25]_I2C</displayName>
                    <description>CLICINT[25]_I2C description</description>
                    <addressOffset>0x00001064</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[26]</name>
                    <displayName>CLICINT[26]_BKP</displayName>
                    <description>CLICINT[26]_BKP description</description>
                    <addressOffset>0x00001068</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[27]</name>
                    <displayName>CLICINT[27]_EXT_INT0</displayName>
                    <description>CLICINT[27]_EXT_INT0 description</description>
                    <addressOffset>0x0000106C</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[28]</name>
                    <displayName>CLICINT[28]_EXT_INT1</displayName>
                    <description>CLICINT[28]_EXT_INT1 description</description>
                    <addressOffset>0x00001070</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[29]</name>
                    <displayName>CLICINT[29]_EXT_INT2</displayName>
                    <description>CLICINT[29]_EXT_INT2 description</description>
                    <addressOffset>0x00001074</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[30]</name>
                    <displayName>CLICINT[30]_ADCUI_F03</displayName>
                    <description>CLICINT[30]_ADCUI_F03 description</description>
                    <addressOffset>0x00001078</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[31]</name>
                    <displayName>CLICINT[31]_ADCUI_F1</displayName>
                    <description>CLICINT[31]_ADCUI_F1 description</description>
                    <addressOffset>0x0000107C</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[32]</name>
                    <displayName>CLICINT[32]_ADCUI_F2</displayName>
                    <description>CLICINT[32]_ADCUI_F2 description</description>
                    <addressOffset>0x00001080</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[33]</name>
                    <displayName>CLICINT[33]</displayName>
                    <description>CLICINT[33] description</description>
                    <addressOffset>0x00001084</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[34]</name>
                    <displayName>CLICINT[34]</displayName>
                    <description>CLICINT[34] description</description>
                    <addressOffset>0x00001088</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[35]</name>
                    <displayName>CLICINT[35]</displayName>
                    <description>CLICINT[35] description</description>
                    <addressOffset>0x0000108C</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[36]</name>
                    <displayName>CLICINT[36]</displayName>
                    <description>CLICINT[36] description</description>
                    <addressOffset>0x00001090</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[37]</name>
                    <displayName>CLICINT[37]_RANDOM</displayName>
                    <description>CLICINT[37]_RANDOM description</description>
                    <addressOffset>0x00001094</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[38]</name>
                    <displayName>CLICINT[38]_ISO7816</displayName>
                    <description>CLICINT[38]_ISO7816 description</description>
                    <addressOffset>0x00001098</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[39]</name>
                    <displayName>CLICINT[39]_UART3</displayName>
                    <description>CLICINT[39]_UART3 description</description>
                    <addressOffset>0x0000109C</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[40]</name>
                    <displayName>CLICINT[40]_SSP2</displayName>
                    <description>CLICINT[40]_SSP2 description</description>
                    <addressOffset>0x000010A0</addressOffset>
                </register>
                <register derivedFrom="CLICINT[0]">
                    <name>CLICINT[41]</name>
                    <displayName>CLICINT[41]_SSP3</displayName>
                    <description>CLICINT[41]_SSP3 description</description>
                    <addressOffset>0x000010A4</addressOffset>
                </register>
