anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR32F02/Eclipse/MDR32F02_Template/svd/MDR1206/MDR1206AFI.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="SSP1">
            <name>SSP2</name>
            <description>SSP2 Interface</description>
            <baseAddress>0x500C8000</baseAddress>
            <interrupt>
                <name>SSP2_IRQ</name>
                <value>24</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="SSP1">
            <name>SSP3</name>
            <description>SSP3 Interface</description>
            <baseAddress>0x500D0000</baseAddress>
            <interrupt>
                <name>SSP3_IRQ</name>
                <value>25</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>UART1</name>
            <description>UART1 Controller</description>
            <groupName>UART1</groupName>
            <baseAddress>0x50008000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>UART1_IRQ</name>
                <value>1</value>
            </interrupt>
            <registers>
                <register>
                    <name>DR</name>
                    <displayName>DR</displayName>
                    <description>Data Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DATA description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>FE</name>
                            <description>Framing error</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STOP_BIT_OK</name>
                                    <description>Stop bit has been received correctly</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOP_BIT_ERR</name>
                                    <description>The received character did not have a valid stop bit (</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>Parity error</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PAR_NO_ERR</name>
                                    <description>Parity error has not been discovered</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PAR_ERR</name>
                                    <description>The parity of the received data character doesn't correspond to the settings of the EPS and SPS bits in the LCR_H register</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BE</name>
                            <description>Break error</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_BREAK_ERR</name>
                                    <description>No break was detected</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BREAK_ERR</name>
                                    <description>A break condition was detected</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OE</name>
                            <description>Overrun error</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_OVERR_ERR</name>
                                    <description>No overrun error was detected</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OVERRUN_ERR</name>
                                    <description>Data is received and the receive FIFO is already full</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSR_ECR</name>
                    <displayName>RSR_ECR</displayName>
                    <description>Receive Status Register/Error Clear Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>FE</name>
                            <description>Framing error</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STOP_BIT_OK</name>
                                    <description>Stop bit has been received correctly</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOP_BIT_ERR</name>
                                    <description>The received character did not have a valid stop bit (</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PE</name>
                            <description>Parity error</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PAR_NO_ERR</name>
                                    <description>Parity error has not been discovered</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PAR_ERR</name>
                                    <description>The parity of the received data character doesn't correspond to the settings of the EPS and SPS bits in the LCR_H register</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BE</name>
                            <description>Break error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_BREAK_ERR</name>
                                    <description>No break was detected</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>BREAK_ERR</name>
                                    <description>A break condition was detected</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>   
                        </field>
                        <field>
                            <name>OE</name>
                            <description>Overrun error</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_OVERR_ERR</name>
                                    <description>No overrun error was detected</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OVERRUN_ERR</name>
                                    <description>Data is received and the receive FIFO is already full</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>  
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FR</name>
                    <displayName>FR</displayName>
                    <description>Flag Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>CTS</name>
                            <description>Inverted state of nUARTCTS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DSR</name>
                            <description>Inverted state of nUARTDSR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCD</name>
                            <description>Inverted state of nUARTDCD</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>UART TX busy</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                <name>UART_TX_READY</name>
                                <description>The UART transmitter is free</description>
                                <value>0x0</value>
                                </enumeratedValue>
                            <enumeratedValue>
                                <name>UART_TX_BUSY</name>
                                <description>The UART is busy transmitting data</description>
                                <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXFE</name>
                            <description>Receive FIFO empty</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFF</name>
                            <description>Transmit FIFO full</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFF</name>
                            <description>Receive FIFO full</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RI</name>
                            <description>Inverted state of nUARTRI</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ILPR</name>
                    <displayName>ILPR</displayName>
                    <description>IrDA Low-Power Counter Register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ILPDVSR</name>
                            <description>Low-power divisor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IBRD</name>
                    <displayName>IBRD</displayName>
                    <description>Integer Baud Rate Register</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BAUDDIV_INT</name>
                            <description>Integer baud rate divisor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FBRD</name>
                    <displayName>FBRD</displayName>
                    <description>Fractional Baud Rate Register</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BAUDDIV_FRAC</name>
                            <description>Fractional baud rate divisor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LCR_H</name>
                    <displayName>LCR_H</displayName>
                    <description>Line Control Register</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BRK</name>
                            <description>Send break</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>Parity enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PAR_DISABLE</name>
                                    <description>No parity bit added to the data frame</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                            <enumeratedValue>
                                    <name>PAR_ENABLE</name>
                                    <description>A parity bit is added to the frame and is checked when received</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EPS</name>
                            <description>Even parity select</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ODD_PARITY</name>
                                    <description>The UART generates or checks for an odd number of 1s in the data and parity bits</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVEN_PARITY</name>
                                    <description>The UART generates or checks for an even number of 1s in the data and parity bits</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STP2</name>
                            <description>Two stop bits select</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STOP_BITS_1</name>
                                    <description>One stop bit is transmitted at the end of the frame</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STOP_BITS_2</name>
                                    <description>Two stop bits are transmitted at the end of the frame</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>FEN</name>
                            <description>Enable FIFOs</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WLEN[1:0]</name>
                            <description>Word length (WLEN[1:0])</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>WLEN_5</name>
                                    <description>5 bits</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WLEN_6</name>
                                    <description>6 bits</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WLEN_7</name>
                                    <description>7 bits</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WLEN_8</name>
                                    <description>8 bits</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SPS</name>
                            <description>Stick parity select</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WLEN[2]</name>
                            <description>Word length (WLEN[2])</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>WLEN_5_8</name>
                                    <description>The number of data bits is defined by WLEN[1:0]</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WLEN_9</name>
                                    <description>The word length is 9 bits</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
