anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR32F02/Eclipse/MDR32F02_Template/svd/MDR1206/MDR1206AFI.svd
                <register>
                    <name>CR</name>
                    <displayName>CR</displayName>
                    <description>Control Register</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>UARTEN</name>
                            <description>UART enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SIREN</name>
                            <description>SIR enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SIRLP</name>
                            <description>IrDA SIR low power mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LBE</name>
                            <description>Loop back enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXE</name>
                            <description>Transmit enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXE</name>
                            <description>Receive enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DTR</name>
                            <description>Inverted state of nUARTDTR</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTS</name>
                            <description>Inverted state of nUARTRTS</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT1</name>
                            <description>Inverted state of nUARTOut1</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUT2</name>
                            <description>Inverted state of nUARTOut2</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTSEN</name>
                            <description>RTS hardware flow control enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                <name>RTS_DISABLED</name>
                                <description>The control of nUARTRTS signal is disabled</description>
                                <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                <name>RTS_ENABLED</name>
                                <description>RTS hardware flow control is enabled. Data is only requested when there is space in the receive FIFO for it to be received.</description>
                                <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTSEN</name>
                            <description>CTS hardware flow control enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                <name>CTS_DISABLED</name>
                                <description>The control of nUARTCTS signal is disabled</description>
                                <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                <name>CTS_ENABLED</name>
                                <description>CTS hardware flow control is enabled. Data is only transmitted when the nUARTCTS signal is asserted</description>
                                <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IFLS</name>
                    <displayName>IFLS</displayName>
                    <description>Interrupt FIFO Level Select Register</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TXIFLSEL</name>
                            <description>Transmit FIFO Level Select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TXF_LVL_1F8</name>
                                    <description>Transmit FIFO becomes ≤ 1/8 full</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TXF_LVL_1F4</name>
                                    <description>Transmit FIFO becomes ≤ 1/4 full</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TXF_LVL_1F2</name>
                                    <description>Transmit FIFO becomes ≤ 1/2 full</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TXF_LVL_3F4</name>
                                    <description>Transmit FIFO becomes ≤ 3/4 full</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TXF_LVL_7F8</name>
                                    <description>Transmit FIFO becomes ≤ 7/8 full</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RXIFLSEL</name>
                            <description>Receive FIFO Level Select</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RXF_LVL_1F8</name>
                                    <description>Receive FIFO becomes ≥ 1/8 full</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXF_LVL_1F4</name>
                                    <description>Receive FIFO becomes ≥ 1/4 full</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXF_LVL_1F2</name>
                                    <description>Receive FIFO becomes ≥ 1/2 full</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXF_LVL_3F4</name>
                                    <description>Receive FIFO becomes ≥ 3/4 full</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RXF_LVL_7F8</name>
                                    <description>Receive FIFO becomes ≥ 7/8 full</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IMSC</name>
                    <displayName>IMSC</displayName>
                    <description>Interrupt Mask Set/Clear Register</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RIMIM</name>
                            <description>nUARTRI modem interrupt mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTSMIM</name>
                            <description>nUARTCTS modem interrupt mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCDMIM</name>
                            <description>nUARTDCD modem interrupt mask</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DSRMIM</name>
                            <description>nUARTDSR modem interrupt mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXIM</name>
                            <description>Receive interrupt mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXIM</name>
                            <description>Transmit interrupt mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTIM</name>
                            <description>Receive timeout interrupt mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEIM</name>
                            <description>Framing error interrupt mask</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEIM</name>
                            <description>Parity error interrupt mask</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BEIM</name>
                            <description>Break error interrupt mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OEIM</name>
                            <description>Receive FIFO overrun interrupt mask</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNEIM</name>
                            <description>Receive FIFO not empty interrupt mask</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFEIM</name>
                            <description>Transmit FIFO empty interrupt mask</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TNBSYIM</name>
                            <description>Transmit shift register empty interrupt mask</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RIS</name>
                    <displayName>RIS</displayName>
                    <description>Raw Interrupt Status Register</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>RIRMIS</name>
                            <description>nUARTRI modem interrupt status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTSRMIS</name>
                            <description>nUARTCTS modem interrupt status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCDRMIS</name>
                            <description>nUARTDCD modem interrupt status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DSRRMIS</name>
                            <description>nUARTDSR modem interrupt status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXRIS</name>
                            <description>Receive interrupt status</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXRIS</name>
                            <description>Transmit interrupt status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTRIS</name>
                            <description>Receive timeout interrupt status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FERIS</name>
                            <description>Framing error interrupt status</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PERIS</name>
                            <description>Parity error interrupt status</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BERIS</name>
                            <description>Break error interrupt status</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OERIS</name>
                            <description>Receive FIFO overrun interrupt status</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNERIS</name>
                            <description>Receive FIFO not empty interrupt status</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFERIS</name>
                            <description>Transmit FIFO empty interrupt status</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TNBSYRIS</name>
                            <description>Transmit shift register empty interrupt status</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
