anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR32F02/Eclipse/MDR32F02_Template/svd/MDR1206/MDR1206AFI.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART2</name>
            <description>UART2 Controller</description>
            <groupName>UART2</groupName>
            <baseAddress>0x50010000</baseAddress>
            <interrupt>
                <name>UART2_IRQ</name>
                <value>2</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART3</name>
            <description>UART3 Controller</description>
            <groupName>UART3</groupName>
            <baseAddress>0x50038000</baseAddress>
            <interrupt>
                <name>UART3_IRQ</name>
                <value>23</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="UART1">
            <name>UART4</name>
            <description>UART4 Controller</description>
            <groupName>UART4</groupName>
            <baseAddress>0x500E8000</baseAddress>
            <interrupt>
                <name>UART4_IRQ</name>
                <value>28</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>FLASH_CNTRL</name>
            <description>FLASH Memory Controller</description>
            <groupName>FLASH_CNTRL</groupName>
            <baseAddress>0x50018000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CMD</name>
                    <displayName>CMD</displayName>
                    <description>Control Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CON</name>
                            <description>Switching the FLASH memory controller to register control</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CE</name>
                            <description>Output address ADR[17:2]</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WE</name>
                            <description>Enable write/erase operations</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RE</name>
                            <description>Reading amplifier</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NVR</name>
                            <description>Main/information block selection</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERASE</name>
                            <description>Erase 512 byte memory page</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHIP</name>
                            <description>Erase the entire sector when ERASE = 1</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PROG</name>
                            <description>Enable programming within 32 word lines</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PROG2</name>
                            <description>Write data from the DI register</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMEN</name>
                            <description>Reset FLASH test mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADR</name>
                    <displayName>ADR</displayName>
                    <description>Address Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>YADR</name>
                            <description>Word address</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>XADR</name>
                            <description>Main: XADR[11] - sector number, XADR[10:2] - page address, XADR[1:0] - row address.
                                         Info: XADR[6] - sector number, XADR[5:2] - page address, XADR[1:0] - row address</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DI</name>
                    <displayName>DI</displayName>
                    <description>Write Data Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>DO</name>
                    <displayName>DO</displayName>
                    <description>Read Data Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>Key register, 0x8AAA5551 unlocks access</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>Control and Test Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BYTE</name>
                            <description>Selecting a byte from the DI register for programming operations</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CONFEN</name>
                            <description>Test bit. Always write 0</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READM0</name>
                            <description>Test bit. Always write 0</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READM1</name>
                            <description>Test bit. Always write 0</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READCF</name>
                            <description>Test bit. Always write 0</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RCELL</name>
                            <description>Test bit. Always write 0</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TERS</name>
                            <description>Test bit. Always write 0</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHIP_ID_CTRL</name>
                    <displayName>CHIP_ID_CTRL</displayName>
                    <description>Chip ID and OTP Control Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>OTP_PROG</name>
                            <description>OTP cell program bit</description>
                            <access>read-write</access>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OTPTST2</name>
                            <description>Test bit</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHIP_ID</name>
                            <description>Chip ID field</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>8</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MDR1206AFI (ID=215)</name>
                                    <description>MDR1206AFI (ID=215)</description>
                                    <value>0xD7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MDR1206FI (ID=217)</name>
                                    <description>MDR1206FI (ID=217)</description>
                                    <value>0xD9</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OTP_KEY</name>
                    <displayName>OTP_KEY</displayName>
                    <description>OTP key register, 0x1555AAA8 unlocks access</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
