anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR32F02/Eclipse/MDR32F02_Template/svd/MDR1206/MDR1206AFI.svd
                <register derivedFrom="RTC_DR">
                    <name>RTC_TSDR1</name>
                    <displayName>RTC_TSDR1</displayName>
                    <description>RTC_TSDR1 description</description>
                    <addressOffset>0x00000040</addressOffset>
                    <access>read-only</access>
                </register>
                <register derivedFrom="RTC_DR">
                    <name>RTC_TSDR2</name>
                    <displayName>RTC_TSDR2</displayName>
                    <description>RTC_TSDR2 description</description>
                    <addressOffset>0x00000044</addressOffset>
                    <access>read-only</access>
                </register>
                <register derivedFrom="RTC_DR">
                    <name>RTC_TSDR3</name>
                    <displayName>RTC_TSDR3</displayName>
                    <description>RTC_TSDR3 description</description>
                    <addressOffset>0x00000048</addressOffset>
                    <access>read-only</access>
                </register>
                <register>
                    <name>RTC_TAFCR</name>
                    <displayName>RTC_TAFCR</displayName>
                    <description>RTC_TAFCR description</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TAMP_EN</name>
                            <description>TAMP_EN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_TRG[0]</name>
                            <description>TAMP_TRG[0] description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_TRG[1]</name>
                            <description>TAMP_TRG[1] description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_TRG[2]</name>
                            <description>TAMP_TRG[2] description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_IE</name>
                            <description>TAMP_IE description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_EN</name>
                            <description>TS_EN description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_EDGE[0]</name>
                            <description>TS_EDGE[0] description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_EDGE[1]</name>
                            <description>TS_EDGE[1] description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_EDGE[2]</name>
                            <description>TS_EDGE[2] description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_IE</name>
                            <description>TS_IE description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_IN_SEL[0]</name>
                            <description>TAMP_IN_SEL[0] description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_IN_SEL[1]</name>
                            <description>TAMP_IN_SEL[1] description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_IN_SEL[2]</name>
                            <description>TAMP_IN_SEL[2] description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_IN_SEL[0]</name>
                            <description>TS_IN_SEL[0] description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_IN_SEL[1]</name>
                            <description>TS_IN_SEL[1] description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_IN_SEL[2]</name>
                            <description>TS_IN_SEL[2] description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAKE_SLEEP</name>
                            <description>WAKE_SLEEP description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_EN_W[0]</name>
                            <description>TAMP_EN_W[0] description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_EN_W[1]</name>
                            <description>TAMP_EN_W[1] description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_EN_W[2]</name>
                            <description>TAMP_EN_W[2] description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_EDGE_W[0]</name>
                            <description>TAMP_EDGE_W[0] description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_EDGE_W[1]</name>
                            <description>TAMP_EDGE_W[1] description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_EDGE_W[2]</name>
                            <description>TAMP_EDGE_W[2] description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_LEVEL_W[0]</name>
                            <description>TAMP_LEVEL_W[0] description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_LEVEL_W[1]</name>
                            <description>TAMP_LEVEL_W[1] description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_LEVEL_W[2]</name>
                            <description>TAMP_LEVEL_W[2] description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_TMPCAL1</name>
                    <displayName>RTC_TMPCAL1</displayName>
                    <description>RTC_TMPCAL1 description</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CONST0</name>
                            <description>CONST0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST1</name>
                            <description>CONST1 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST2</name>
                            <description>CONST2 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST3</name>
                            <description>CONST3 description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST4</name>
                            <description>CONST4 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST5</name>
                            <description>CONST5 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST6[1:0]</name>
                            <description>CONST6[1:0] description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_TMPCAL2</name>
                    <displayName>RTC_TMPCAL2</displayName>
                    <description>RTC_TMPCAL2 description</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CONST6[4:2]</name>
                            <description>CONST6[4:2] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CONST7</name>
                            <description>CONST7 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST8</name>
                            <description>CONST8 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST9</name>
                            <description>CONST9 description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST10</name>
                            <description>CONST10 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST11</name>
                            <description>CONST11 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST12[3:0]</name>
                            <description>CONST12[3:0] description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_TMPCAL3</name>
                    <displayName>RTC_TMPCAL3</displayName>
                    <description>RTC_TMPCAL3 description</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SWCTR_INV</name>
                            <description>SWCTR_INV description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BLDO_TRIM_B2</name>
                            <description>BLDO_TRIM_B2 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSE_CONF_B2</name>
                            <description>LSE_CONF_B2 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEMP_EN</name>
                            <description>TEMP_EN description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONST12[4]</name>
                            <description>CONST12[4] description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONST13</name>
                            <description>CONST13 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST14</name>
                            <description>CONST14 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST15</name>
                            <description>CONST15 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>TEMP_RESULT</name>
                            <description>TEMP_RESULT description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TEMP_RESULT_RDY</name>
                            <description>TEMP_RESULT_RDY description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
