anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR32F02/Eclipse/MDR32F02_Template/svd/MDR1206/MDR1206AFI.svd
                <register>
                    <name>CCAL1</name>
                    <displayName>CCAL1</displayName>
                    <description>CCAL1 description</description>
                    <addressOffset>0x00000114</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I0BGAIN</name>
                            <description>I0BGAIN description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>V0BGAIN</name>
                            <description>V0BGAIN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL2</name>
                    <displayName>CCAL2</displayName>
                    <description>CCAL2 description</description>
                    <addressOffset>0x00000118</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I1BGAIN</name>
                            <description>I1BGAIN description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>V1BGAIN</name>
                            <description>V1BGAIN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL3</name>
                    <displayName>CCAL3</displayName>
                    <description>CCAL3 description</description>
                    <addressOffset>0x0000011C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I2BGAIN</name>
                            <description>I2BGAIN description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>V2BGAIN</name>
                            <description>V2BGAIN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCAL4</name>
                    <displayName>CCAL4</displayName>
                    <description>CCAL4 description</description>
                    <addressOffset>0x00000120</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I3BGAIN</name>
                            <description>I3BGAIN description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0IRMS_INACTIVE</name>
                    <displayName>F0IRMS_INACTIVE</displayName>
                    <description>F0IRMS_INACTIVE description</description>
                    <addressOffset>0x00000124</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0IRMS_INACTIVE</name>
                            <description>F0IRMS_INACTIVE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WATTP_L</name>
                    <displayName>F0WATTP_L</displayName>
                    <description>F0WATTP_L description</description>
                    <addressOffset>0x00000128</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0WATTHRP_L</name>
                            <description>F0WATTHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0WATTN_L</name>
                    <displayName>F0WATTN_L</displayName>
                    <description>F0WATTN_L description</description>
                    <addressOffset>0x0000012C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0WATTHRN_L</name>
                            <description>F0WATTHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VARP_L</name>
                    <displayName>F0VARP_L</displayName>
                    <description>F0VARP_L description</description>
                    <addressOffset>0x00000130</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VARHRP_L</name>
                            <description>F0VARHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VARN_L</name>
                    <displayName>F0VARN_L</displayName>
                    <description>F0VARN_L description</description>
                    <addressOffset>0x00000134</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VARHRN_L</name>
                            <description>F0VARHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VR_L</name>
                    <displayName>F0VR_L</displayName>
                    <description>F0VR_L description</description>
                    <addressOffset>0x00000138</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VAHR_L</name>
                            <description>F0VAHR_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1WATTP_L</name>
                    <displayName>F1WATTP_L</displayName>
                    <description>F1WATTP_L description</description>
                    <addressOffset>0x0000013C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1WATTHRP_L</name>
                            <description>F1WATTHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1WATTN_L</name>
                    <displayName>F1WATTN_L</displayName>
                    <description>F1WATTN_L description</description>
                    <addressOffset>0x00000140</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1WATTHRN_L</name>
                            <description>F1WATTHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VARP_L</name>
                    <displayName>F1VARP_L</displayName>
                    <description>F1VARP_L description</description>
                    <addressOffset>0x00000144</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VARHRP_L</name>
                            <description>F1VARHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VARN_L</name>
                    <displayName>F1VARN_L</displayName>
                    <description>F1VARN_L description</description>
                    <addressOffset>0x00000148</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VARHRN_L</name>
                            <description>F1VARHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VR_L</name>
                    <displayName>F1VR_L</displayName>
                    <description>F1VR_L description</description>
                    <addressOffset>0x0000014C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VAHR_L</name>
                            <description>F1VAHR_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2WATTP_L</name>
                    <displayName>F2WATTP_L</displayName>
                    <description>F2WATTP_L description</description>
                    <addressOffset>0x00000150</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2WATTHRP_L</name>
                            <description>F2WATTHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2WATTN_L</name>
                    <displayName>F2WATTN_L</displayName>
                    <description>F2WATTN_L description</description>
                    <addressOffset>0x00000154</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2WATTHRN_L</name>
                            <description>F2WATTHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VARP_L</name>
                    <displayName>F2VARP_L</displayName>
                    <description>F2VARP_L description</description>
                    <addressOffset>0x00000158</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VARHRP_L</name>
                            <description>F2VARHRP_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VARN_L</name>
                    <displayName>F2VARN_L</displayName>
                    <description>F2VARN_L description</description>
                    <addressOffset>0x0000015C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VARHRN_L</name>
                            <description>F2VARHRN_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VR_L</name>
                    <displayName>F2VR_L</displayName>
                    <description>F2VR_L description</description>
                    <addressOffset>0x00000160</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VAHR_L</name>
                            <description>F2VAHR_L description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>25</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOAD</name>
                    <displayName>LOAD</displayName>
                    <description>LOAD description</description>
                    <addressOffset>0x00000164</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VANOLOAD</name>
                            <description>VANOLOAD description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>VARNOLOAD</name>
                            <description>VARNOLOAD description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>APNOLOAD</name>
                            <description>APNOLOAD description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F0VRMS_TRUE</name>
                    <displayName>F0VRMS_TRUE</displayName>
                    <description>F0VRMS_TRUE description</description>
                    <addressOffset>0x00000168</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F0VRMS_TRUE</name>
                            <description>F0VRMS_TRUE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VRMS_TRUE</name>
                    <displayName>F1VRMS_TRUE</displayName>
                    <description>F1VRMS_TRUE description</description>
                    <addressOffset>0x0000016C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VRMS_TRUE</name>
                            <description>F1VRMS_TRUE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VRMS_TRUE</name>
                    <displayName>F2VRMS_TRUE</displayName>
                    <description>F2VRMS_TRUE description</description>
                    <addressOffset>0x00000170</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VRMS_TRUE</name>
                            <description>F2VRMS_TRUE description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>29</bitWidth>
                        </field>
                    </fields>
                </register>
