anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR32F02/Eclipse/MDR32F02_Template/svd/MDR1206/MDR1206AFI.svd
                <register>
                    <name>MSC</name>
                    <displayName>MSC</displayName>
                    <description>MSC description</description>
                    <addressOffset>0x00000174</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DMA_EN_RQ_B_1</name>
                            <description>DMA_EN_RQ_B_1 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_2</name>
                            <description>DMA_EN_RQ_B_2 description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_3</name>
                            <description>DMA_EN_RQ_B_3 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_4</name>
                            <description>DMA_EN_RQ_B_4 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_5</name>
                            <description>DMA_EN_RQ_B_5 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_6</name>
                            <description>DMA_EN_RQ_B_6 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_B_7</name>
                            <description>DMA_EN_RQ_B_7 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_1</name>
                            <description>DMA_EN_RQ_S_1 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_2</name>
                            <description>DMA_EN_RQ_S_2 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_3</name>
                            <description>DMA_EN_RQ_S_3 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_4</name>
                            <description>DMA_EN_RQ_S_4 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_5</name>
                            <description>DMA_EN_RQ_S_5 description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_6</name>
                            <description>DMA_EN_RQ_S_6 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA_EN_RQ_S_7</name>
                            <description>DMA_EN_RQ_S_7 description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0ISEL_HPF</name>
                            <description>F0ISEL_HPF description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1ISEL_HPF</name>
                            <description>F1ISEL_HPF description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F2ISEL_HPF</name>
                            <description>F2ISEL_HPF description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F0VPHASE[1:0]</name>
                            <description>F0VPHASE[1:0] description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>F90_CONF</name>
                            <description>F90_CONF description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FILTERCFG</name>
                    <displayName>FILTERCFG</displayName>
                    <description>FILTERCFG description</description>
                    <addressOffset>0x00000178</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CHPF_COEFF</name>
                            <description>CHPF_COEFF description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>CLRMS_COEFF</name>
                            <description>CLRMS_COEFF description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>CHP_ADC_CFG</name>
                            <description>CHP_ADC_CFG description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKPHASE1</name>
                    <displayName>CLKPHASE1</displayName>
                    <description>CLKPHASE1 description</description>
                    <addressOffset>0x0000017C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I0PHASE[9:0]</name>
                            <description>I0PHASE[9:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>I1PHASE[9:0]</name>
                            <description>I1PHASE[9:0] description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>I2PHASE[9:0]</name>
                            <description>I2PHASE[9:0] description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>CLC_ADC_CFG</name>
                            <description>CLC_ADC_CFG description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKPHASE2</name>
                    <displayName>CLKPHASE2</displayName>
                    <description>CLKPHASE2 description</description>
                    <addressOffset>0x00000180</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>I3PHASE[9:0]</name>
                            <description>I3PHASE[9:0] description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
