anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR32F02/Eclipse/MDR32F02_Template/svd/MDR1206/MDR1206AFI.svd
                <register derivedFrom="CH1_CNTRL2">
                    <name>CH2_CNTRL2</name>
                    <displayName>CH2_CNTRL2</displayName>
                    <description>CH2_CNTRL2 description</description>
                    <addressOffset>0x00000064</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL2">
                    <name>CH3_CNTRL2</name>
                    <displayName>CH3_CNTRL2</displayName>
                    <description>CH3_CNTRL2 description</description>
                    <addressOffset>0x00000068</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL2">
                    <name>CH4_CNTRL2</name>
                    <displayName>CH4_CNTRL2</displayName>
                    <description>CH4_CNTRL2 description</description>
                    <addressOffset>0x0000006C</addressOffset>
                </register>
                <register>
                    <name>CH1_CCR1</name>
                    <displayName>CH1_CCR1</displayName>
                    <description>CH1_CCR1 description</description>
                    <addressOffset>0x00000070</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH2_CCR1</name>
                    <displayName>CH2_CCR1</displayName>
                    <description>CH2_CCR1 description</description>
                    <addressOffset>0x00000074</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH3_CCR1</name>
                    <displayName>CH3_CCR1</displayName>
                    <description>CH3_CCR1 description</description>
                    <addressOffset>0x00000078</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>CH4_CCR1</name>
                    <displayName>CH4_CCR1</displayName>
                    <description>CH4_CCR1 description</description>
                    <addressOffset>0x0000007C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="TIMER1">
            <name>TIMER2</name>
            <description>TIMER2 description</description>
            <groupName>TIMER2</groupName>
            <baseAddress>0x50078000</baseAddress>
            <interrupt>
                <name>TIMER2_IRQ</name>
                <value>7</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TIMER1">
            <name>TIMER3</name>
            <description>TIMER3 description</description>
            <groupName>TIMER3</groupName>
            <baseAddress>0x500D8000</baseAddress>
            <interrupt>
                <name>TIMER3_IRQ</name>
                <value>26</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TIMER1">
            <name>TIMER4</name>
            <description>TIMER4 description</description>
            <groupName>TIMER4</groupName>
            <baseAddress>0x500E0000</baseAddress>
            <interrupt>
                <name>TIMER4_IRQ</name>
                <value>27</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>PORTA</name>
            <description>PORTA description</description>
            <groupName>PORTA</groupName>
            <baseAddress>0x50080000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EXT_INT1_IRQ</name>
                <value>11</value>
            </interrupt>
            <registers>
                <register>
                    <name>RXTX</name>
                    <displayName>RXTX</displayName>
                    <description>RXTX description</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PIN0</name>
                            <description>PIN0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN1</name>
                            <description>PIN1 description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN2</name>
                            <description>PIN2 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN3</name>
                            <description>PIN3 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN4</name>
                            <description>PIN4 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN5</name>
                            <description>PIN5 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN6</name>
                            <description>PIN6 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN7</name>
                            <description>PIN7 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN8</name>
                            <description>PIN8 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN9</name>
                            <description>PIN9 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN10</name>
                            <description>PIN10 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN11</name>
                            <description>PIN11 description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN12</name>
                            <description>PIN12 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN13</name>
                            <description>PIN13 description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN14</name>
                            <description>PIN14 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN15</name>
                            <description>PIN15 description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="RXTX">
                    <name>OE</name>
                    <displayName>OE</displayName>
                    <description>OE description</description>
                    <addressOffset>0x00000004</addressOffset>
                </register>
                <register>
                    <name>FUNC</name>
                    <displayName>FUNC</displayName>
                    <description>FUNC description</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PIN0</name>
                            <description>PIN0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN1</name>
                            <description>PIN1 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN2</name>
                            <description>PIN2 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN3</name>
                            <description>PIN3 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN4</name>
                            <description>PIN4 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN5</name>
                            <description>PIN5 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN6</name>
                            <description>PIN6 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN7</name>
                            <description>PIN7 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN8</name>
                            <description>PIN8 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN9</name>
                            <description>PIN9 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN10</name>
                            <description>PIN10 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN11</name>
                            <description>PIN11 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN12</name>
                            <description>PIN12 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN13</name>
                            <description>PIN13 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN14</name>
                            <description>PIN14 description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PIN15</name>
                            <description>PIN15 description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="RXTX">
                    <name>ANALOG</name>
                    <displayName>ANALOG</displayName>
                    <description>ANALOG description</description>
                    <addressOffset>0x0000000C</addressOffset>
                </register>
