anisyanka/milandr-fvp-joy/libs/STDPeriph/Example_Projects/MDR32F02/Eclipse/MDR32F02_Template/svd/MDR1206/MDR1206AFI.svd
                <register>
                    <name>PULL</name>
                    <displayName>PULL</displayName>
                    <description>PULL description</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PULL_DOWN_PIN0</name>
                            <description>PULL_DOWN_PIN0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN1</name>
                            <description>PULL_DOWN_PIN1 description</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN2</name>
                            <description>PULL_DOWN_PIN2 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN3</name>
                            <description>PULL_DOWN_PIN3 description</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN4</name>
                            <description>PULL_DOWN_PIN4 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN5</name>
                            <description>PULL_DOWN_PIN5 description</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN6</name>
                            <description>PULL_DOWN_PIN6 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN7</name>
                            <description>PULL_DOWN_PIN7 description</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN8</name>
                            <description>PULL_DOWN_PIN8 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN9</name>
                            <description>PULL_DOWN_PIN9 description</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN10</name>
                            <description>PULL_DOWN_PIN10 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN11</name>
                            <description>PULL_DOWN_PIN11 description</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN12</name>
                            <description>PULL_DOWN_PIN12 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN13</name>
                            <description>PULL_DOWN_PIN13 description</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN14</name>
                            <description>PULL_DOWN_PIN14 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_DOWN_PIN15</name>
                            <description>PULL_DOWN_PIN15 description</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN0</name>
                            <description>PULL_UP_PIN0 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN1</name>
                            <description>PULL_UP_PIN1 description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN2</name>
                            <description>PULL_UP_PIN2 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN3</name>
                            <description>PULL_UP_PIN3 description</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN4</name>
                            <description>PULL_UP_PIN4 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN5</name>
                            <description>PULL_UP_PIN5 description</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN6</name>
                            <description>PULL_UP_PIN6 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN7</name>
                            <description>PULL_UP_PIN7 description</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN8</name>
                            <description>PULL_UP_PIN8 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN9</name>
                            <description>PULL_UP_PIN9 description</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN10</name>
                            <description>PULL_UP_PIN10 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN11</name>
                            <description>PULL_UP_PIN11 description</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN12</name>
                            <description>PULL_UP_PIN12 description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN13</name>
                            <description>PULL_UP_PIN13 description</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN14</name>
                            <description>PULL_UP_PIN14 description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PULL_UP_PIN15</name>
                            <description>PULL_UP_PIN15 description</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PWR</name>
                    <displayName>PWR</displayName>
                    <description>PWR description</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PIN0</name>
                            <description>PIN0 description</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN1</name>
                            <description>PIN1 description</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN2</name>
                            <description>PIN2 description</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN3</name>
                            <description>PIN3 description</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN4</name>
                            <description>PIN4 description</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN5</name>
                            <description>PIN5 description</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN6</name>
                            <description>PIN6 description</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN7</name>
                            <description>PIN7 description</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN8</name>
                            <description>PIN8 description</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN9</name>
                            <description>PIN9 description</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN10</name>
                            <description>PIN10 description</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN11</name>
                            <description>PIN11 description</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN12</name>
                            <description>PIN12 description</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN13</name>
                            <description>PIN13 description</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN14</name>
                            <description>PIN14 description</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN15</name>
                            <description>PIN15 description</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="RXTX">
                    <name>SETTX</name>
                    <displayName>SETTX</displayName>
                    <description>SETTX description</description>
                    <addressOffset>0x00000020</addressOffset>
                </register>
                <register>
                    <name>CLRTX</name>
                    <displayName>CLRTX</displayName>
                    <description>CLRTX description</description>
                    <addressOffset>0x00000024</addressOffset>
                </register>
                <register derivedFrom="RXTX">
                    <name>RDTX</name>
                    <displayName>RDTX</displayName>
                    <description>RDTX description</description>
                    <addressOffset>0x00000028</addressOffset>
                    <access>read-only</access>
                </register>
